-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        5.0.18-nt - MySQL Community Edition (GPL)
-- 服务器操作系统:                      Win32
-- HeidiSQL 版本:                  8.1.0.4673
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 导出 weibo 的数据库结构
CREATE DATABASE IF NOT EXISTS `weibo` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `weibo`;


-- 导出  表 weibo.user_info 结构
CREATE TABLE IF NOT EXISTS `user_info` (
  `user_id` varchar(50) NOT NULL COMMENT '用户id',
  `name` varchar(50) default NULL COMMENT '昵称',
  `sex` varchar(50) default NULL COMMENT '性别',
  `address` varchar(200) default NULL COMMENT '所在地',
  `introduce` text COMMENT '简介',
  `register_date` date default NULL COMMENT '注册时间',
  `tag` varchar(200) default NULL COMMENT '标签',
  `remark` varchar(200) default NULL COMMENT '备注',
  `company` varchar(200) default NULL COMMENT '公司',
  `level` varchar(200) default NULL COMMENT '等级',
  PRIMARY KEY  (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- 正在导出表  weibo.user_info 的数据：~0 rows (大约)
/*!40000 ALTER TABLE `user_info` DISABLE KEYS */;
INSERT INTO `user_info` (`user_id`, `name`, `sex`, `address`, `introduce`, `register_date`, `tag`, `remark`, `company`, `level`) VALUES
	('1280519351', '夏洛1101', '女', '安徽 芜湖', 'ambrosia，cytoplasm', '2013-01-25', NULL, NULL, NULL, 'LV 24'),
	('1709007923', '是七月了', '女', '广东 广州', '写字的', '2011-02-11', NULL, NULL, NULL, 'LV 31'),
	('1778431645', '里里青', '女', '湖南 长沙', '原来你是我最想留住的幸运●﹏●', '2010-07-18', NULL, NULL, NULL, 'LV 33'),
	('1848154655', '菜小贱_', '男', '浙江', '努力让生活有意义，不断地学习', '2010-11-05', NULL, NULL, NULL, 'LV 27'),
	('1873512184', '全球奢侈品精选定制537', '女', '海外 英国', 'V信：6322502，最具权威的奢侈品一线品牌，领军高端品牌网络平台，倡导精致生活方式，Hermann手臂纹身本人实拍，全部原单品质鞋子。', '2010-11-30', NULL, NULL, NULL, 'LV 7'),
	('1883529595', '你哦-迟到千年', '女', '河南', '暂无简介', '2010-12-05', NULL, NULL, NULL, 'LV 24'),
	('1896771021', '李皮碰碳弹', '男', '广东 湛江', '把疯狂英语坚持到底！', '2010-12-18', NULL, NULL, NULL, 'LV 23'),
	('2129251321', '吴子长卿', '男', '河南 郑州', '上善若水，顺势而为，润物无声。', '2011-05-11', NULL, NULL, '郑州宇通集团有限公司', 'LV 26'),
	('2152184603', '呆萌的随遇而安009', '女', '河南', '暂无简介', '2011-05-28', NULL, NULL, NULL, 'LV 3'),
	('2278803620', '江西姑娘2014', '女', '江西 宜春', '江西姑娘在广州', '2011-07-31', NULL, NULL, '华东交通大学', 'LV 9'),
	('2337184213', 'Crescent攒钱买水果吃', '女', '河南', '普普通通一人，没什么可介绍的。', '2011-09-01', NULL, NULL, NULL, 'LV 14'),
	('2439102630', 'HERO-佩', '女', '湖北 武汉', '暂无简介', '2011-10-03', NULL, NULL, NULL, 'LV 15'),
	('2463981367', '广州90后理财师', '男', '广东 广州', '财富热线13826169750，微信18976012811，欢迎来电！！！', '2011-11-14', NULL, NULL, '宜信普惠', 'LV 12'),
	('2592969157', '静心听雨2592969157', '女', '陕西', '暂无简介', '2012-01-26', NULL, NULL, NULL, 'LV 9'),
	('2668070514', '媛琳garden', '女', '河南 洛阳', '女大自巧，狗大自咬', '2012-01-16', NULL, NULL, NULL, 'LV 17'),
	('2679212061', 'JM洁洁和自己对话', '女', '北京', '林家俊杰无可取代，LOVE U U.', '2012-03-23', NULL, NULL, NULL, 'LV 25'),
	('2684004712', '爱哭的流忙兔3190-赵小杰', '男', '上海', '我一背子就会好你一个人你高幸就好我不会在取了', '2012-01-25', NULL, NULL, '威能', 'LV 10'),
	('2709889681', '我真的不是卤蛋', '女', '河南 济源', '暂无简介', '2012-04-16', NULL, NULL, NULL, 'LV 25'),
	('2717348861', '林家小丸很黏青', '女', '广东 肇庆', '活在我心内 分开也像同渡过…', '2012-04-22', NULL, NULL, NULL, 'LV 26'),
	('2775577381', 'vivo大羊', '男', '福建 泉州', '暂无简介', '2012-05-21', NULL, NULL, NULL, 'LV 21'),
	('2824110071', '红叶一凡沉_829', '女', '其他', '暂无简介', '2012-07-06', NULL, NULL, NULL, 'LV 2'),
	('2938954331', 'Jenng半永久定妆私人订制', '女', '河南 郑州', '半永久定妆，要懒更要美～ 早上起床晚不怕啦！ 出大汗不怕啦！ 下雨天不怕啦！ 面试不怕啦！ 相亲不怕啦！ 不会化妆不怕啦～总之什么都不怕啦～', '2012-09-04', NULL, NULL, '半永久化妆', 'LV 12'),
	('2940986281', '凌君颁', '男', '广东 湛江', '浪荡红尘，没有硝烟的战场，孤心傲，一人一骑，于此一生，被血渲染了的天空，留下了岁月的痕迹～～', '2012-09-06', NULL, NULL, NULL, 'LV 9'),
	('2942297420', '董红艳2011微艾', '女', '江苏 泰州', '河北正定农电工工资月薪1400 正式工月薪10000', '2012-09-19', NULL, NULL, NULL, 'LV 5'),
	('2954261981', '明明如月321', '男', '辽宁 沈阳', '闹够了没', '2012-12-17', NULL, NULL, NULL, 'LV 15'),
	('3176357243', '淼淼的微笑向日葵', '女', '河南 洛阳', '暂无简介', '2012-12-06', NULL, NULL, NULL, 'LV 6'),
	('3213096563', 'Reilly-Wang', '女', '北京 海淀区', '愿所有的改变，都不负初心。', '2013-01-06', NULL, NULL, NULL, 'LV 9'),
	('3239227551', 'WHYYHWc', '女', '海外 法国', '暂无简介', '2014-07-20', NULL, NULL, NULL, 'LV 4'),
	('3241420214', '手机用户3241420214', '男', '北京', '暂无简介', '2013-04-02', NULL, NULL, NULL, NULL),
	('3254219873', '十七年蝉之夏', '女', '北京 通州区', '...', '2013-05-04', NULL, NULL, NULL, 'LV 14'),
	('3258640510', '子攸520', '女', '河南 南阳', '爱笑', '2013-03-12', NULL, NULL, NULL, 'LV 14'),
	('3543444773', '_anita瑶瑶', '女', '湖南 长沙', '无论大事还是小事，只要自己是认为办得好的，就坚定地去办，这就是性格。--歌德', '2013-06-18', NULL, NULL, NULL, 'LV 4'),
	('3571400135', '八_卦门户粉丝团', '男', '其他', '暂无简介', '2013-07-02', NULL, NULL, NULL, 'LV 6'),
	('3579597140', '狼心d', '男', '其他', '暂无简介', '2013-07-26', NULL, NULL, NULL, 'LV 13'),
	('3772362931', '用户3772362931', '男', '其他', '暂无简介', '2013-09-05', NULL, NULL, NULL, 'LV 6'),
	('3822840431', 'Rola_含卉', '女', '重庆 江北区', '她一直活在他转身离去那天', '2013-09-29', NULL, NULL, NULL, 'LV 6'),
	('3824913615', '泡儿hubble-bubble泡儿', '女', '河南 洛阳', 'boom！boom！boom！boom！', '2014-04-03', NULL, NULL, NULL, 'LV 27'),
	('3840655861', '用户3840655861', '女', '河南 洛阳', '做一个安静细微的人     于角落里自在开放', '2013-10-15', NULL, NULL, NULL, 'LV 14'),
	('3847056412', 'Tiramisu鱼京', '女', '重庆 涪陵区', '精神像乳汁一样可以养育人的，智慧便是一只乳房。', '2013-10-12', NULL, NULL, NULL, 'LV 16'),
	('3853927306', '用户3853927306', '男', '其他', '暂无简介', '2013-10-14', NULL, NULL, NULL, 'LV 3'),
	('3853934334', 'soslovely妙治', '女', '海外', '暂无简介', '2013-10-14', NULL, NULL, NULL, 'LV 6'),
	('3889330576', '重金佟', '女', '其他', '暂无简介', '2013-11-06', NULL, NULL, NULL, 'LV 6'),
	('3906503473', '龚张氏', '男', '河南 信阳', '暂无简介', '2013-11-16', NULL, NULL, NULL, 'LV 9'),
	('3914590656', '淘气喵喵er', '女', '山东 青岛', '瑜伽老师', '2013-11-24', NULL, NULL, NULL, 'LV 9'),
	('3931513301', '淘气包啦', '女', '其他', '暂无简介', '2013-12-07', NULL, NULL, NULL, 'LV 7'),
	('3934379468', '好好菇酿', '男', '广东 深圳', '暂无简介', '2013-12-06', NULL, NULL, NULL, 'LV 8'),
	('3979282615', '我叫李痴汉', '男', '其他', '暂无简介', '2014-04-06', NULL, NULL, NULL, 'LV 5'),
	('3988276550', '逃亡米醋', '男', '辽宁 丹东', '暂无简介', '2014-01-17', NULL, NULL, NULL, 'LV 7'),
	('5027219714', '工口赛高', '男', '北京 西城区', '暂无简介', '2014-02-07', NULL, NULL, NULL, 'LV 7'),
	('5055455366', '鹿宝的晨晨', '女', '上海', '这样不太好……', '2014-03-03', NULL, NULL, NULL, 'LV 25'),
	('5064504426', '夏洛特噗冲动的小马甲', '女', '宁夏 吴忠', '暂无简介', '2014-03-09', NULL, NULL, NULL, 'LV 7'),
	('5070269458', '郇擀娄詥唯远', '女', '江苏 南通', '暂无简介', '2014-03-15', NULL, NULL, NULL, 'LV 5'),
	('5076602684', '清河我爱我家', '男', '贵州 铜仁', '暂无简介', '2014-03-19', NULL, NULL, NULL, 'LV 1'),
	('5088438152', '吕是最好得', '男', '北京 东城区', '暂无简介', '2014-03-31', NULL, NULL, NULL, 'LV 3'),
	('5095897811', '无霾便晴天', '男', '黑龙江 大庆', '有志者自有千方百计，无志者只感千难万难。', '2014-04-02', NULL, NULL, NULL, 'LV 5'),
	('5102282734', '笑我一个试试', '男', '江西 萍乡', '一滴水只有放进大海里才永远不会干涸，一个人只有当他把自己和集体事业融合在一起的时候才能最有力量。－－雷锋', '2014-04-07', NULL, NULL, NULL, 'LV 1'),
	('5119882623', '远菲豪f', '女', '重庆 万盛区', '当一个人真正觉悟的一刻，他放弃追寻外在世界的财富，而开始追寻他内心世界的真正财富。', '2014-04-24', NULL, NULL, NULL, 'LV 6'),
	('5121350680', '小蜜切切', '男', '贵州 铜仁', '暂无简介', '2014-04-22', NULL, NULL, NULL, 'LV 5'),
	('5154499269', '栗栗安Lillian翀', '女', '广东 惠州', '五官刺激，不是真正的享受。内在安祥，才是下手之处。', '2014-07-14', NULL, NULL, NULL, 'LV 6'),
	('5181158229', '拾忆萱', '女', '广东 东莞', '希望自己随时随地都能保持快乐的心情', '2014-06-15', NULL, NULL, NULL, 'LV 12'),
	('5199434044', '周小洲不说话', '男', '其他', '活着，为的是替整体做点事，滴水是有沾润作用，但滴水必加入河海，才能成为波涛。－－谢觉哉', '2014-06-30', NULL, NULL, NULL, 'LV 1'),
	('5292291481', '营养护肤讲师林林', '女', '广东 惠州', '暂无简介', '2014-09-13', NULL, NULL, NULL, 'LV 10'),
	('5293460079', '诚信名品手表依霜', '女', '广东 广州', '瑞士机械石英一比一质量 终身维修.工厂直销确认下单当天见实物微信号 juncai12345 QQ270589020', '2014-09-15', NULL, NULL, '暂无', 'LV 1'),
	('5334418992', '球球奢品汇Yvonn', '女', '广东', '球球奢饰品专做顶级品质添加weixin更多商品 :qiuqiushishang 明码标价，厂家一手货源 ，广招代理', '2014-10-16', NULL, NULL, NULL, 'LV 1'),
	('5366050732', '护肤导师-伊伊伊', '女', '其他', '暂无简介', '2015-01-24', NULL, NULL, NULL, 'LV 12'),
	('5394473093', '伊恩名表复刻绮琴', '男', '海外', '网站www.ianwatch.com 微信ian058', '2014-11-30', NULL, NULL, NULL, 'LV 5'),
	('5594992322', '泡泡爱流浪', '男', '北京 朝阳区', '在路上~', '2015-05-19', NULL, NULL, NULL, 'LV 14'),
	('5602115440', '经典精品517', '男', '广东 广州', '专业批发高端皮具，专做精品。有自己加工厂，有具体批发档口。欢迎具体店加盟，诚邀全国微商代理。一件代发！下单微信号：13642702220', '2015-05-05', NULL, NULL, NULL, 'LV 7'),
	('5625075705', '用户5625075705', '男', '广东', '暂无简介', '2015-06-06', NULL, NULL, NULL, 'LV 8'),
	('5677595761', '姚俊文_奢侈原单代发', '男', '湖北 宜昌', '暂无简介', '2015-08-14', NULL, NULL, NULL, 'LV 5'),
	('5797311585', '私人订制银饰刘凤英', '男', '其他', '暂无简介', '2015-12-18', NULL, NULL, NULL, 'LV 1'),
	('5827613088', '一生所写527', '女', '湖南 郴州', '一个简单的女孩', '2016-01-12', NULL, NULL, '中国电信集团公司', 'LV 12'),
	('5872745815', '陈毅198407', '男', '河南 洛阳', '暂无简介', '2016-03-03', NULL, NULL, NULL, 'LV 1'),
	('5891866753', '唯美语句收藏', '女', '福建 福州', '暂无简介', '2016-04-02', NULL, NULL, NULL, 'LV 9'),
	('5898487016', 'love5898487016', '女', '湖南 益阳', '长沙.云集.全球领先的电商平台.诚招分店主', '2016-04-15', NULL, NULL, NULL, 'LV 5'),
	('5920972243', '手冢0403199002', '女', '安徽 六安', '暂无简介', '2016-05-18', NULL, NULL, NULL, 'LV 9'),
	('5922266693', '最佳Fans70626', '女', '天津 滨海新区', '暂无简介', '2016-05-31', NULL, NULL, NULL, 'LV 9'),
	('5922666303', 'Lucky--April201311', '男', '湖南 娄底', '暂无简介', '2016-05-14', NULL, NULL, NULL, 'LV 9'),
	('5928606941', '海贼王fighting', '女', '广东 广州', '暂无简介', '2016-05-11', NULL, NULL, NULL, 'LV 4'),
	('5964226789', '仟锦云200711', '女', '上海 虹口区', '暂无简介', '2016-06-20', NULL, NULL, NULL, 'LV 9'),
	('5974646313', '木鱼鱼鱼鱼鱼娘王后', '女', '西藏 拉萨', '暂无简介', '2016-07-01', NULL, NULL, NULL, 'LV 11'),
	('5992108569', 'jjjw3rw3e', '女', '上海 卢湾区', 'zixun薇 xin：wendy900200（其他已满），主打五官设计改造、脂肪填充混血脸、假体隆胸、吸脂塑身。', '2016-07-30', NULL, NULL, NULL, 'LV 14'),
	('6005790667', 'Leonlemonzz', '女', '江苏 徐州', '暂无简介', '2016-08-20', NULL, NULL, NULL, 'LV 4'),
	('6214728616', '用户6214728616', '男', '河南 洛阳', '暂无简介', '2017-04-16', NULL, NULL, NULL, 'LV 1');
/*!40000 ALTER TABLE `user_info` ENABLE KEYS */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
